{
    "loading": "กำลังโหลด",
    "gif": "เลือก GIF ของคุณ",
    "more": "แสดงเพิ่มเติม",
    "less": "แสดงน้อยลง",
    "loadFile": "อัปโหลดไฟล์",
    "limit": "PNG, JPG, GIF ขนาดไม่เกิน 10MB",
    "create": "สร้าง",
    "noOnePost": "ผู้ใช้ยังไม่ได้โพสต์เลย",
    "noOneSaved": "ผู้ใช้ยังไม่ได้บันทึกโพสต์เลย",
    "noOneFollower": "ผู้ใช้นี้ไม่มีผู้ติดตาม",
    "noOneFollowing": "ผู้ใช้นี้ไม่ได้ติดตามใครในขณะนี้",
    "noOneFriend": "ผู้ใช้นี้ยังไม่มีเพื่อน",
    "copyRight": "สงวนสิทธิ์ทั้งหมด.",
    "nav": {
        "home": "หน้าแรก",
        "createPost": "สร้างโพสต์",
        "admin": "ผู้ดูแลระบบ",
        "logout": "ออกจากระบบ",
        "profile": "โปรไฟล์",
        "friend": "เพื่อน",
        "mess": "ข้อความ",
        "language": "ภาษา"
    },
    "about": {
        "aboutMe": "เกี่ยวกับฉัน",
        "livesIn": "อาศัยอยู่ที่",
        "joined": "เข้าร่วมเมื่อ",
        "followedBy": "ติดตามโดย",
        "editDetails": "แก้ไขรายละเอียด",
        "coding": "การเขียนโปรแกรม",
        "people": "คน"
    },
    "home": {
        "home": "หน้าแรก",
        "createPost": "สร้างโพสต์",
        "admin": "ผู้ดูแลระบบ",
        "logout": "ออกจากระบบ",
        "profile": "โปรไฟล์",
        "new": "มีอะไรใหม่",
        "post": "โพสต์!"
    },
    "auth": {
        "slogan": "เก็บความทรงจำ แบ่งปันเรื่องราว",
        "signIn": "เข้าสู่ระบบ",
        "signUp": "สมัครสมาชิก",
        "google": "เข้าสู่ระบบด้วย Google",
        "github": "เข้าสู่ระบบด้วย Github",
        "other": "เข้าสู่ระบบด้วยอีเมลและรหัสผ่าน",
        "otherSignUp": "สมัครสมาชิกด้วยอีเมลและรหัสผ่าน",
        "password": "รหัสผ่าน",
        "noAccount": "ยังไม่มีบัญชีใช่ไหม?",
        "hasAccount": "คุณมีบัญชีอยู่แล้วใช่ไหม?",
        "fullName": "ชื่อเต็ม",
        "agree": "ฉันยอมรับข้อกำหนดการให้บริการของ SnapShare",
        "TOF": "เงื่อนไขการให้บริการ",
        "toast-1": "ที่อยู่อีเมลไม่ถูกต้อง! โปรดป้อนที่อยู่อีเมลที่ถูกต้อง",
        "toast-2": "รหัสผ่านไม่ถูกต้อง! รหัสผ่านต้องมีอักขระอย่างน้อย 8 ตัวอักษรและรวมทั้งตัวอักษรและตัวเลข",
        "toast-3": "ชื่อไม่ถูกต้อง โปรดป้อนชื่อที่ถูกต้อง",
        "toast-4": "ที่อยู่อีเมลที่ให้ไว้ใช้งานแล้ว!",
        "toast-5": "อีเมลหรือรหัสผ่านไม่ถูกต้อง!",
        "toast-6": "ล้มเหลวในการเข้าสู่ระบบ!",
        "toast-7": "ยินดีด้วย! คุณพร้อมแล้ว โปรดเข้าสู่ระบบเพื่อเริ่มต้นใช้งาน",
        "toast-8": "เข้าสู่ระบบสำเร็จแล้ว!"
    },
    "post": {
        "pinned": "โพสต์ที่ตรึง",
        "other": "โพสต์อื่น ๆ",
        "like": "ถูกใจ",
        "comment": "แสดงความคิดเห็น",
        "share": "แชร์",
        "pin": "ตรึงโพสต์",
        "unpin": "ยกเลิกการตรึงโพสต์",
        "remove": "ลบโพสต์",
        "random": "ถูกใจแบบสุ่ม",
        "save": "บันทึกโพสต์",
        "report": "รายงานโพสต์",
        "you": "คุณ",
        "and": "และ",
        "otherPeople": "คนอื่น",
        "liked": "ถูกใจโพสต์นี้",
        "toast-1": "โพสต์ของคุณถูกลบเรียบร้อยแล้ว!",
        "toast-2": "บันทึกเรียบร้อย",
        "toast-3": "ถูกใจเรียบร้อยแล้วในการโพสต์ของคุณ",
        "diaLog": {
            "title": "คุณต้องการลบโพสต์นี้หรือไม่?",
            "content": "เมื่อคุณคลิกที่ปุ่มตกลง กล่องโต้ตอบจะปิดหลังจาก 1 วินาที"
        }
    },
    "comment": {
        "toast-1": "ลบความคิดเห็นเรียบร้อยแล้ว!",
        "delete": "ลบความคิดเห็น",
        "edit": "แก้ไขความคิดเห็น",
        "report": "รายงานความคิดเห็น"
    },
    "search": {
        "all": "ค้นหาผลลัพธ์ทั้งหมดสำหรับ",
        "placeholder": "ป้อนชื่อโปรไฟล์..."
    },
    "profile": {
        "follow": "ติดตาม",
        "update": "อัปเดตโปรไฟล์",
        "add": "เพิ่มเพื่อน",
        "unFollow": "ยกเลิกติดตาม",
        "unFriend": "ยกเลิกเป็นเพื่อน",
        "message": "ข้อความ",
        "cancelRequest": "ยกเลิกคำขอ",
        "confirmed": "SnapShare ยืนยันว่าโปรไฟล์นี้ถูกต้อง",
        "posts": "โพสต์",
        "friend": "เพื่อน",
        "followers": "ผู้ติดตาม",
        "following": "กำลังติดตาม",
        "saved": "บันทึกแล้ว",
        "setting": {
            "toast": "ชื่อไม่ถูกต้อง โปรดป้อนชื่อที่ถูกต้อง",
            "toast-2": "สำเร็จแล้ว! การเปลี่ยนแปลงของคุณได้รับการบันทึกแล้ว",
            "title": "การตั้งค่าบัญชี",
            "name": "ชื่อเต็ม",
            "bio": "ไบโอ",
            "email": "ที่อยู่อีเมล",
            "website": "เว็บไซต์",
            "address": "ที่อยู่",
            "userId": "รหัสผู้ใช้",
            "avatar": "อวาตาร์",
            "cover": "ปก",
            "submit": "บันทึก"
        }
    },
    "createPost": {
        "toast-1": "อัปโหลดรูปภาพสำเร็จ!",
        "toast-2": "ไม่สามารถโพสต์ได้ โปรดตรวจสอบว่าโพสต์ของคุณตรงตามข้อกำหนด",
        "submit": "โพสต์",
        "title": "สร้างโพสต์",
        "public": "สาธารณะ",
        "private": "ส่วนตัว",
        "placeholder": "คุณคิดอะไรอยู่?"
    },
    "admin": {
        "title": "รายชื่อผู้ใช้",
        "more": "โหลดเพิ่มเติม...",
        "registered": "ลงทะเบียนเมื่อ",
        "view": "ดู",
        "unverify": "ยกเลิกการยืนยัน",
        "verify": "ยืนยัน"
    },
    "pageError": {
        "button": "กลับสู่หน้าหลัก",
        "403": {
            "title": "การเข้าถึงถูกปฏิเสธ",
            "desc": "หน้าที่ร้องขอไม่มีอยู่ คุณไม่ได้รับอนุญาตให้เข้าถึงพื้นที่ผู้ดูแลระบบ"
        },
        "404": {
            "title": "ไม่พบหน้า",
            "desc": "ไม่พบหน้า โปรดตรวจสอบ URL หรือกลับสู่หน้าหลัก"
        }
    },
    "Language": {
        "title": "เลือกภาษา"
    },
    "suggestion": {
        "request": {
            "title": "คำขอ",
            "desc": "ต้องการเพิ่มคุณเป็นเพื่อน",
            "accept": "ยอมรับ",
            "decline": "ปฏิเสธ"
        },
        "friendActive": {
            "title": "รายชื่อผู้ติดต่อ"
        }
    },

    "theme": {
        "dark": "สีเข้ม",
        "light": "สีอ่อน",
        "theme": "ธีม"
    },
    "chats": {
        "title": "แชท",
        "online": "ออนไลน์",
        "sidebar": {
            "placeholder": "ค้นหา messenger..."
        },
        "windowChat": {
            "placeholder": "พิมพ์อะไรบางอย่าง",
            "sentImage": "ส่งรูปภาพแล้ว"
        },
        "detail": {
            "profile": "โปรไฟล์",
            "mute": "ปิดเสียง",
            "search": "ค้นหา",
            "other": "สื่อ, ไฟล์ และลิงก์",
            "media": "สื่อ",
            "file": "ไฟล์",
            "links": "ลิงก์",
            "sent": "ส่งแล้ว"
        }
    },
    "notifications": {
        "title": "การแจ้งเตือน",
        "new": "ใหม่",
        "earlier": "ก่อนหน้านี้",
        "delete": "ลบการแจ้งเตือนทั้งหมด",
        "addFriend": "ได้ส่งคำขอเป็นเพื่อนให้คุณ",
        "acceptFriend": "ได้ยอมรับคำขอเป็นเพื่อนของคุณ",
        "follow": "กำลังติดตามคุณ",
        "mess": "ได้ส่งข้อความถึงคุณ",
        "comment": "ได้แสดงความคิดเห็นในโพสต์ของคุณ",
        "like": "ได้ถูกใจโพสต์ของคุณ"
    },
    "privacyPolicy": "นโยบายความเป็นส่วนตัว",
    "termsConditions": "ข้อกำหนดและเงื่อนไข",
    "cookiesPolicy": "นโยบายคุกกี้",
    "privacyPolicyPage": {
        "title": "นโยบายความเป็นส่วนตัว",
        "lastUpdated": "อัปเดตล่าสุด: 25 มิถุนายน พ.ศ. 2566",
        "description1": "นโยบายความเป็นส่วนตัวนี้อธิบายนโยบายและกระบวนการของเราในการเก็บรวบรวม ใช้งาน และเปิดเผยข้อมูลของคุณเมื่อคุณใช้บริการ และให้ข้อมูลเกี่ยวกับสิทธิความเป็นส่วนตัวของคุณและวิธีที่กฎหมายปกป้องคุณ",
        "description2": "เราใช้ข้อมูลส่วนบุคคลของคุณเพื่อให้บริการและปรับปรุงบริการ โดยใช้บริการนี้แสดงว่าคุณยินยอมให้เราเก็บรวบรวมและใช้ข้อมูลตามนโยบายความเป็นส่วนตัวนี้",
        "interpretation": {
            "title": "การตีความและคำนิยาม",
            "interpretationHeading": "การตีความ",
            "interpretationDescription": "คำที่ตัวอักษรตัวแรกขึ้นต้นด้วยตัวพิมพ์ใหญ่มีความหมายตามเงื่อนไขต่อไปนี้ นิยามต่อไปนี้จะมีความหมายเดียวกันไม่ว่าจะปรากฏในรูปเดี่ยวหรือในรูปพหูพจน์",
            "definitionsHeading": "นิยาม",
            "definitions": {
                "overView": "เพื่อวัตถุประสงค์ในนโยบายความเป็นส่วนตัวนี้:",
                "arrayMap": [
                    {
                        "title": "บัญชี",
                        "description": "หมายถึงบัญชีที่สร้างขึ้นเฉพาะสำหรับคุณใช้เข้าถึงบริการของเราหรือส่วนของบริการของเรา"
                    },
                    {
                        "title": "Affiliate",
                        "description": "หมายถึงหน่วยงานที่ควบคุม อยู่ภายใต้ความควบคุมร่วมกันกับฝ่ายหนึ่ง เมื่อกล่าวถึงความควบคุมหมายถึงการครอบครองของหุ้นส่วน 50% หรือมากกว่าของหุ้น ส่วนทุนหรือหลักทรัพย์อื่น ๆ ที่มีสิทธิลงคะแนนในการเลือกตั้งกรรมการหรือเจ้าหน้าที่ผู้บริหารอื่น"
                    },
                    {
                        "title": "บริษัท",
                        "description": "(เรียกว่า \"บริษัท\", \"เรา\", \"เรา\" หรือ \"ของเรา\" ในข้อตกลงนี้) หมายถึง Snap Share"
                    },
                    {
                        "title": "คุกกี้",
                        "description": "เป็นไฟล์เล็กที่มีอยู่บนคอมพิวเตอร์ของคุณ อุปกรณ์เคลื่อนที่หรืออุปกรณ์อื่น ๆ ใด ๆ โดยมีรายละเอียดของประวัติการเรียกดูของคุณในเว็บไซต์นั้น ๆ อยู่ในไฟล์ดังกล่าวระหว่างการใช้งาน"
                    },
                    {
                        "title": "ประเทศ",
                        "description": "หมายถึง: ไทย"
                    },
                    {
                        "title": "อุปกรณ์",
                        "description": "หมายถึงอุปกรณ์ใด ๆ ที่สามารถเข้าถึงบริการได้ เช่น คอมพิวเตอร์ โทรศัพท์มือถือ หรือแท็บเล็ตดิจิตอล"
                    },
                    {
                        "title": "ข้อมูลส่วนบุคคล",
                        "description": "หมายถึงข้อมูลใด ๆ ที่เกี่ยวข้องกับบุคคลที่ระบุหรือที่สามารถระบุได้"
                    },
                    {
                        "title": "บริการ",
                        "description": "หมายถึงเว็บไซต์"
                    },
                    {
                        "title": "ผู้ให้บริการบริการ",
                        "description": "หมายถึงบุคคลธรรมชาติหรือนิติบุคคลใด ๆ ที่ประมวลผลข้อมูลในนามของบริษัท หมายถึงบริษัทหรือบุคคลธรรมดาที่ได้รับจ้างโดยบริษัทเพื่อส่งมอบบริการ ให้บริการเป็นชื่อแทนบริษัท ทำการบริการที่เกี่ยวข้องกับบริการหรือช่วยให้บริษัทสามารถวิเคราะห์การใช้งานของบริการได้"
                    },
                    {
                        "title": "บริการสื่อสังคมที่เป็นบุคคลที่สาม",
                        "description": "หมายถึงเว็บไซต์ใด ๆ หรือเว็บไซต์โซเชียลเน็ตเวิร์กใด ๆ ที่ผู้ใช้งานสามารถเข้าสู่ระบบหรือสร้างบัญชีเพื่อใช้บริการได้"
                    },
                    {
                        "title": "ข้อมูลการใช้งาน",
                        "description": "หมายถึงข้อมูลที่เก็บรวบรวมอัตโนมัติทั้งที่สร้างขึ้นโดยการใช้งานของบริการหรือจากโครงสร้างพื้นฐานของบริการเอง (ตัวอย่างเช่น ระยะเวลาในการเข้าชมหน้าเว็บ)"
                    }
                ],
                "website": {
                    "title": "เว็บไซต์",
                    "description": "หมายถึง Snap Share ที่สามารถเข้าถึงได้จาก ",
                    "URL": "https://snap-share-78f51.web.app/"
                },
                "you": {
                    "title": "คุณ",
                    "description": "หมายถึงบุคคลที่เข้าถึงหรือใช้บริการ หรือบริษัท หรือนิติบุคคลอื่นที่เป็นส่วนหนึ่งในองค์กรซึ่งบุคคลดังกล่าวเข้าถึงหรือใช้บริการ ตามที่เป็นไปได้"
                }
            }
        },
        "collectingAndUsingData": {
            "title": "การเก็บรวบรวมและใช้ข้อมูลส่วนบุคคลของคุณ",
            "dataCollected": {
                "title": "ประเภทของข้อมูลที่เก็บรวบรวม",
                "personalData": {
                    "title": "ข้อมูลส่วนบุคคล",
                    "description": "ในขณะที่คุณใช้บริการของเรา เราอาจขอให้คุณให้ข้อมูลที่ระบุตัวตนบางประการซึ่งสามารถใช้ในการติดต่อหรือระบุตัวคุณได้ ข้อมูลที่ระบุตัวตนอาจรวมถึง แต่ไม่จำกัดเพียง"
                },
                "personalDataPoints": ["ที่อยู่อีเมล", "ชื่อและนามสกุล", "ข้อมูลการใช้งาน"]
            },
            "usageData": {
                "title": "ข้อมูลการใช้งาน",
                "description": "ข้อมูลการใช้งานถูกเก็บรวบรวมอัตโนมัติขณะใช้บริการ"
            },
            "usageDataPoints": [
                "ข้อมูลการใช้งานอาจรวมข้อมูลเช่นหมายเลขไอพีของอุปกรณ์ของคุณ (เช่นที่อยู่ไอพี), ประเภทเบราว์เซอร์, เวอร์ชันเบราว์เซอร์, หน้าของบริการของเราที่คุณเข้าชม, เวลาและวันที่ของการเข้าชมของคุณ, เวลาที่ใช้บนหน้าเหล่านั้น, ตัวระบุอุปกรณ์ที่ไม่ซ้ำกันและข้อมูลการวินิจฉัยอื่นๆ",
                "เมื่อคุณเข้าถึงบริการผ่านอุปกรณ์มือถือ เราอาจเก็บรวบรวมข้อมูลบางส่วนอัตโนมัติเช่น ประเภทอุปกรณ์มือถือที่คุณใช้, รหัสพิเศษของอุปกรณ์มือถือของคุณ, ที่อยู่ไอพีของอุปกรณ์มือถือของคุณ, ระบบปฏิบัติการของอุปกรณ์มือถือของคุณ, ประเภทเบราว์เซอร์อินเทอร์เน็ตบนอุปกรณ์มือถือที่คุณใช้, ตัวระบุอุปกรณ์ที่ไม่ซ้ำกันและข้อมูลการวินิจฉัยอื่นๆ",
                "เราอาจเก็บรวบรวมข้อมูลที่เบราว์เซอร์ของคุณส่งตลอดเวลาที่คุณเข้าชมบริการของเราหรือเมื่อคุณเข้าถึงบริการผ่านอุปกรณ์มือถือ"
            ],
            "mobileDeviceData": {
                "title": "ข้อมูลจากบริการโซเชียลมีเดียบุคคลที่สาม",
                "description": "บริษัทช่วยให้คุณสร้างบัญชีและเข้าสู่ระบบใช้บริการผ่านบริการโซเชียลมีเดียบุคคลต่อไปนี้"
            },
            "mobileDeviceDataPoints": ["Google", "Facebook", "Instagram", "Twitter", "LinkedIn"],
            "mobileDeviceDataAdditionalInfo": {
                "title": "ข้อมูลจากบริการโซเชียลมีเดียบุคคลที่สาม (ต่อ)",
                "description_1": "หากคุณตัดสินใจลงทะเบียนหรือให้เราเข้าถึงบัญชีบริการโซเชียลมีเดียบุคคลที่สาม เราอาจเก็บรวบรวมข้อมูลส่วนบุคคลที่เกี่ยวข้องกับบัญชีบริการโซเชียลมีเดียบุคคลของคุณแล้ว เช่น ชื่อของคุณ ที่อยู่อีเมลของคุณ กิจกรรมของคุณ หรือรายชื่อผู้ติดต่อของคุณที่เกี่ยวข้องกับบัญชีนั้น",
                "description_2": "คุณยังมีตัวเลือกในการแบ่งปันข้อมูลเพิ่มเติมกับบริษัทผ่านบัญชีบริการโซเชียลมีเดียบุคคลของคุณ หากคุณเลือกที่จะให้ข้อมูลเพิ่มเติมและข้อมูลส่วนบุคคลนั้นในขณะลงทะเบียนหรือเป็นอย่างอื่น คุณกำหนดให้บริษัทมีสิทธิ์ใช้ แชร์ และเก็บรักษาข้อมูลนั้นได้ตามนโยบายความเป็นส่วนตัวนี้"
            },
            "trackingTechnologies": {
                "title": "เทคโนโลยีติดตามและคุกกี้",
                "description": "เราใช้คุกกี้และเทคโนโลยีติดตามที่คล้ายกันเพื่อติดตามกิจกรรมในบริการของเราและจัดเก็บข้อมูลบางส่วน การใช้เทคโนโลยีติดตามที่เราใช้อาจรวมถึง"
            },
            "trackingTechnologiesPoints": [
                {
                    "title": "คุกกี้หรือคุกกี้ของเบราว์เซอร์: ",
                    "desc": "คุกกี้เป็นไฟล์ขนาดเล็กที่วางไว้ในอุปกรณ์ของคุณ คุณสามารถกำหนดให้เบราว์เซอร์ของคุณปฏิเสธคุกกี้ทั้งหมดหรือแจ้งเตือนเมื่อมีการส่งคุกกี้ อย่างไรก็ตามหากคุณไม่ยอมรับคุกกี้ อาจทำให้คุณไม่สามารถใช้ส่วนบางส่วนของบริการของเราได้ ยกเว้นในกรณีที่คุณได้ปรับแต่งการตั้งค่าเบราว์เซอร์ของคุณเพื่อปฏิเสธคุกกี้ เราอาจใช้คุกกี้ในบริการของเรา"
                },
                {
                    "title": "เว็บบีคอน: ",
                    "desc": "บางส่วนของบริการของเราและอีเมลของเราอาจมีไฟล์อิเล็กทรอนิกส์ขนาดเล็กที่เรียกว่าเว็บบีคอน (web beacons) (ที่เรียกให้เห็นได้ชัดว่า clear gifs, pixel tags, และ single-pixel gifs) ซึ่งอนุญาตให้บริษัท เช่น นับจำนวนผู้ใช้ที่เข้าชมหน้าเว็บหรือเปิดอีเมลและเพื่อเป็นสถิติเว็บไซต์ที่เกี่ยวข้องอื่นๆ (เช่น บันทึกความนิยมของส่วนที่เฉพาะเจาะจงและการตรวจสอบความถูกต้องของระบบและเซิร์ฟเวอร์)"
                }
            ],
            "trackingTechnologiesPointsOverview": "คุกกี้สามารถเป็น \"คุกกี้ที่อยู่อาศัย\" หรือ \"คุกกี้แบบเซสชัน\" คุกกี้ที่อยู่อาศัยจะยังคงอยู่ในเครื่องคอมพิวเตอร์ส่วนตัวหรืออุปกรณ์เคลื่อนที่ของคุณเมื่อคุณออฟไลน์ ในขณะที่คุกกี้แบบเซสชันจะถูกลบทันทีเมื่อคุณปิดเบราว์เซอร์ ดูข้อมูลเพิ่มเติมเกี่ยวกับคุกกี้ได้ที่บทความในเว็บไซต์ Free Privacy Policy",
            "cookiesPolicy": {
                "title": "นโยบายคุกกี้: ",
                "description": "เราใช้คุกกี้แบบเซสชันและคุกกี้แบบคงที่เพื่อวัตถุประสงค์ดังต่อไปนี้:"
            },
            "cookiesPolicyPoints": [
                {
                    "typeName": "ประเภท",
                    "type": "คุกกี้ที่จำเป็น / คุกกี้ที่สำคัญ",
                    "cookieType": "คุกกี้แบบเซสชัน",
                    "administeredByName": "ดูแลโดย",
                    "administeredBy": "เรา",
                    "purposeName": "วัตถุประสงค์",
                    "purpose": "คุกกี้เหล่านี้เป็นสิ่งจำเป็นในการให้บริการแก่คุณผ่านเว็บไซต์และเพื่ออำนวยความสะดวกในการใช้งานบางส่วนของเว็บไซต์ เช่น ใช้ในการยืนยันตัวตนของผู้ใช้และป้องกันการใช้บัญชีผู้ใช้โดยไม่ถูกอนุญาต หากไม่มีคุกกี้เหล่านี้บริการที่คุณขอจะไม่สามารถให้บริการได้ และเราใช้คุกกี้เหล่านี้เพื่อให้บริการเฉพาะเจาะจงนั้นเท่านั้น"
                },
                {
                    "typeName": "ประเภท",
                    "administeredByName": "ดูแลโดย",
                    "purposeName": "วัตถุประสงค์",
                    "type": "คุกกี้นโยบาย / คุกกี้ยอมรับแจ้งเตือน",
                    "cookieType": "คุกกี้แบบคงที่",
                    "administeredBy": "เรา",
                    "purpose": "คุกกี้เหล่านี้ใช้ในการระบุว่าผู้ใช้ยอมรับการใช้คุกกี้บนเว็บไซต์"
                },
                {
                    "typeName": "ประเภท",
                    "administeredByName": "ดูแลโดย",
                    "purposeName": "วัตถุประสงค์",
                    "type": "คุกกี้ฟังก์ชัน",
                    "cookieType": "คุกกี้แบบคงที่",
                    "administeredBy": "เรา",
                    "purpose": "คุกกี้เหล่านี้ช่วยให้เราจำค่าที่คุณทำเมื่อคุณใช้เว็บไซต์ เช่น จำรายละเอียดการเข้าสู่ระบบหรือค่าที่ตั้งไว้เป็นภาษา วัตถุประสงค์ของคุกกี้เหล่านี้คือการให้คุณได้สัมผัสประสบการณ์ที่ส่วนตัวมากขึ้นและไม่ต้องใส่ค่าตัวเลือกของคุณใหม่ทุกครั้งที่คุณใช้เว็บไซต์"
                }
            ],
            "additionalInfo": "สำหรับข้อมูลเพิ่มเติมเกี่ยวกับคุกกี้ที่เราใช้และตัวเลือกของคุณเกี่ยวกับคุกกี้ โปรดเยี่ยมชมนโยบายคุกกี้ของเราหรือส่วนคุกกี้ของนโยบายความเป็นส่วนตัวของเรา"
        },
        "useOfPersonalData": {
            "title": "การใช้ข้อมูลส่วนบุคคลของคุณ",
            "overView_1": "บริษัทอาจใช้ข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์ดังต่อไปนี้:",
            "purposes": [
                {
                    "purpose_highlight": "เพื่อให้บริการและบำรุงรักษาบริการของเรา",
                    "purpose": "รวมถึงการตรวจสอบการใช้บริการของเรา"
                },
                {
                    "purpose_highlight": "เพื่อการจัดการบัญชีของคุณ",
                    "purpose": "เพื่อการจัดการการลงทะเบียนของคุณในฐานะผู้ใช้บริการ ข้อมูลส่วนบุคคลที่คุณให้บริการสามารถให้คุณเข้าถึงฟังก์ชันต่างๆ ของบริการที่มีอยู่สำหรับคุณในฐานะผู้ใช้ที่ลงทะเบียนแล้ว"
                },
                {
                    "purpose_highlight": "เพื่อปฏิบัติตามสัญญา",
                    "purpose": "การพัฒนา ปฏิบัติตาม และดำเนินการสัญญาซื้อสินค้า รายการ หรือบริการที่คุณซื้อหรือสัญญาอื่นๆ กับเราผ่านทางบริการ"
                },
                {
                    "purpose_highlight": "เพื่อติดต่อคุณ",
                    "purpose": "เพื่อติดต่อคุณทางอีเมล โทรศัพท์ ข้อความ SMS หรือรูปแบบอิเล็กทรอนิกส์ที่เทียบเท่า เช่น การแจ้งเตือนผ่านแอปพลิเคชันบนมือถือเกี่ยวกับการอัปเดตหรือสื่อสารที่เกี่ยวข้องกับความสามารถ ผลิตภัณฑ์หรือบริการที่คุณได้ทำการสัญญา รวมถึงการอัปเดตด้านความปลอดภัยเมื่อจำเป็นหรือเหมาะสมสำหรับการปฏิบัติงาน"
                },
                {
                    "purpose_highlight": "เพื่อให้ข้อมูลข่าวสาร ข้อเสนอพิเศษ และข้อมูลทั่วไปเกี่ยวกับสินค้า บริการและเหตุการณ์อื่นๆ",
                    "purpose": "ที่เรามีเสมือนกับสิ่งที่คุณได้ซื้อหรือสอบถามเกี่ยวกับ ยกเว้นหากคุณได้เลือกที่จะไม่รับข้อมูลดังกล่าว"
                },
                {
                    "purpose_highlight": "เพื่อการจัดการคำขอของคุณ",
                    "purpose": "เพื่อดูแลและจัดการคำขอของคุณกับเรา"
                },
                {
                    "purpose_highlight": "สำหรับการโอนทางธุรกิจ",
                    "purpose": "เราอาจใช้ข้อมูลของคุณเพื่อประเมินหรือดำเนินการในเรื่องการรวมธุรกิจ การขายทรัพย์สิน การเงิน หรือการเพิ่มทุน หรือการรับซื้อธุรกิจของเราทั้งหมดหรือบางส่วนจากบริษัทอื่น"
                },
                {
                    "purpose_highlight": "สำหรับวัตถุประสงค์อื่นๆ",
                    "purpose": "เราอาจใช้ข้อมูลของคุณสำหรับวัตถุประสงค์อื่นๆ เช่นการวิเคราะห์ข้อมูล การระบุแนวโน้มการใช้งาน การกำหนดประสิทธิภาพของแคมเปญโปรโมชั่นของเราและการประเมินและปรับปรุงบริการ ผลิตภัณฑ์ บริการ การตลาด และประสบการณ์ของคุณ"
                }
            ],
            "overView_2": "เราอาจแบ่งปันข้อมูลส่วนบุคคลของคุณในสถานการณ์ต่อไปนี้:",
            "sharingSituations": [
                {
                    "situation_highlight": "กับผู้ให้บริการ",
                    "situation": "เราอาจแบ่งปันข้อมูลส่วนบุคคลของคุณกับผู้ให้บริการเพื่อตรวจสอบและวิเคราะห์การใช้บริการของเรา หรือเพื่อติดต่อคุณ"
                },
                {
                    "situation_highlight": "สำหรับการโอนทางธุรกิจ",
                    "situation": "เราอาจแบ่งปันหรือโอนข้อมูลส่วนบุคคลของคุณในกระบวนการเชื่อมโยงกับการเจรจาซื้อขายสินค้า ทรัพย์สินของบริษัท การเงิน หรือการรับซื้อธุรกิจของเราทั้งหมดหรือบางส่วนไปยังบริษัทอื่น"
                },
                {
                    "situation_highlight": "กับบริษัทในเครือ",
                    "situation": "เราอาจแบ่งปันข้อมูลของคุณกับบริษัทในเครือของเรา โดยที่เราจะขอให้บริษัทในเครือปฏิบัติตามนโยบายความเป็นส่วนตัวนี้ บริษัทในเครือรวมถึงบริษัทหลักของเราและบริษัทย่อย หรือคู่ค้าหุ้นส่วนร่วมอื่นๆ หรือบริษัทอื่นๆ ที่เราควบคุมหรือที่อยู่ในการควบคุมร่วมกันกับเรา"
                },
                {
                    "situation_highlight": "กับพาร์ทเนอร์ทางธุรกิจ",
                    "situation": "เราอาจแบ่งปันข้อมูลของคุณกับพาร์ทเนอร์ทางธุรกิจของเราเพื่อมอบให้คุณบางสิ่งบางอย่าง บริการ หรือโปรโมชั่นเฉพาะ"
                },
                {
                    "situation_highlight": "กับผู้ใช้รายอื่น",
                    "situation": "เมื่อคุณแชร์ข้อมูลส่วนบุคคลหรือปฏิสัมพันธ์ในพื้นที่สาธารณะกับผู้ใช้รายอื่น ข้อมูลดังกล่าวอาจถูกมองเห็นโดยผู้ใช้รายอื่นทั้งหมดและอาจถูกกระจายออกไปสู่สาธารณะ หากคุณมีปฏิสัมพันธ์กับผู้ใช้รายอื่นหรือลงทะเบียนผ่านบริการของโซเชียลมีเดียของฝ่ายที่สาม รายชื่อผู้ติดต่อของคุณในโซเชียลมีเดียรายชื่อของบุคคลที่ติดต่อที่สามารถเห็นชื่อ โปรไฟล์ รูปภาพ และคำอธิบายเกี่ยวกับกิจกรรมของคุณผู้ใช้รายอื่นก็สามารถดูคำอธิบายเกี่ยวกับกิจกรรมของคุณ สื่อสารกับคุณ และดูโปรไฟล์ของคุณได้"
                },
                {
                    "situation_highlight": "ด้วยความยินยอมของคุณ",
                    "situation": "เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณสำหรับวัตถุประสงค์อื่น ๆ ตามความยินยอมของคุณ"
                }
            ]
        },

        "retentionOfData": {
            "title": "การเก็บรักษาข้อมูลส่วนบุคคลของคุณ",
            "paragraphs": [
                {
                    "text": "บริษัทจะเก็บข้อมูลส่วนบุคคลของคุณเฉพาะเมื่อจำเป็นตามวัตถุประสงค์ที่ระบุในนโยบายความเป็นส่วนตัวนี้ เราจะเก็บรักษาและใช้ข้อมูลส่วนบุคคลของคุณในขอบเขตที่จำเป็นเพื่อปฏิบัติตามหน้าที่ตามกฎหมาย (ตัวอย่างเช่นหากเราต้องเก็บข้อมูลของคุณตามกฎหมายที่ใช้บังคับเพื่อปฏิบัติตามกฎหมายที่ใช้บังคับ การแก้ไขข้อพิพาท และการบังคับใช้ข้อกำหนดและนโยบายทางกฎหมายของเรา)"
                },
                {
                    "text": "บริษัทยังจะเก็บข้อมูลการใช้บริการเพื่อวัตถุประสงค์การวิเคราะห์ภายใน ข้อมูลการใช้บริการจะถูกเก็บรักษาเป็นระยะเวลาสั้นกว่า ยกเว้นในกรณีที่ข้อมูลดังกล่าวใช้เพื่อเสริมความปลอดภัยหรือปรับปรุงฟังก์ชันของบริการของเรา หรือหากเรามีหน้าที่ตามกฎหมายที่ต้องเก็บข้อมูลดังกล่าวเป็นระยะเวลานานขึ้น"
                }
            ]
        },
        "transferOfData": {
            "title": "การโอนข้อมูลส่วนบุคคลของคุณ",
            "paragraphs": [
                {
                    "text": "ข้อมูลของคุณรวมถึงข้อมูลส่วนบุคคลจะถูกดำเนินการในสำนักงานทำการของบริษัทและในสถานที่อื่นที่มีส่วนร่วมในการดำเนินการ นั่นหมายความว่าข้อมูลนี้อาจถูกโอนไปยังคอมพิวเตอร์ที่ตั้งนอกจังหวัดหรือประเทศของคุณ ซึ่งกฎหมายที่เกี่ยวกับความคุ้มครองข้อมูลอาจแตกต่างจากกฎหมายในเขตองคุณ"
                },
                {
                    "text": "การยินยอมของคุณต่อนโยบายความเป็นส่วนตัวนี้ที่เกิดขึ้นหลังจากคุณส่งข้อมูลเช่นนั้นถือเป็นการเห็นชอบในการโอนข้อมูลดังกล่าว"
                },
                {
                    "text": "บริษัทจะดำเนินการตามทุกขั้นตอนที่จำเป็นอย่างยุติธรรมเพื่อให้ข้อมูลของคุณได้รับการจัดการอย่างปลอดภัยและสอดคล้องกับนโยบายความเป็นส่วนตัวนี้ และจะไม่มีการโอนข้อมูลส่วนบุคคลของคุณไปยังองค์กรหรือประเทศใด ๆ เว้นแต่จะมีการควบคุมที่เพียงพอเช่นความปลอดภัยของข้อมูลของคุณและข้อมูลส่วนบุคคลอื่น ๆ"
                }
            ]
        },
        "deletePersonalData": {
            "title": "ลบข้อมูลส่วนบุคคลของคุณ",
            "paragraphs": [
                {
                    "text": "คุณมีสิทธิ์ในการลบหรือขอให้เราช่วยในการลบข้อมูลส่วนบุคคลที่เราเก็บรวบรวมเกี่ยวกับคุณ"
                },
                {
                    "text": "บริการของเราอาจให้คุณสามารถลบข้อมูลบางส่วนเกี่ยวกับคุณจากภายในบริการได้"
                },
                {
                    "text": "คุณสามารถอัปเดต แก้ไขหรือลบข้อมูลของคุณได้ทุกเมื่อโดยเข้าสู่ระบบในบัญชีของคุณหากคุณมีบัญชี และเข้าสู่ส่วนการตั้งค่าบัญชีที่ให้คุณจัดการข้อมูลส่วนบุคคลของคุณ คุณยังสามารถติดต่อเราเพื่อขอเข้าถึง แก้ไข หรือลบข้อมูลส่วนบุคคลใด ๆ ที่คุณได้รับมาจากเรา"
                },
                {
                    "text": "โปรดทราบว่าเราอาจต้องเก็บรักษาข้อมูลบางส่วนเมื่อเรามีหน้าที่ตามกฎหมายหรือมีเหตุผลที่ถูกต้องในการเก็บรักษาข้อมูล"
                }
            ]
        },
        "disclosureOfPersonalData": {
            "title": "การเปิดเผยข้อมูลส่วนบุคคลของคุณ",
            "businessTransactions": {
                "title": "ธุรกิจแลกเปลี่ยน",
                "content": "หากบริษัทมีส่วนร่วมในการผสานรวมธุรกิจ การเข้าซื้อหรือการขายทรัพย์สิน ข้อมูลส่วนบุคคลของคุณอาจถูกโอน ก่อนที่ข้อมูลส่วนบุคคลของคุณจะถูกโอนและเปลี่ยนแปลงตามนโยบายความเป็นส่วนตัวที่แตกต่าง"
            },
            "lawEnforcement": {
                "title": "การบังคับกฎหมาย",
                "content": "ภายใต้สถานการณ์บางประการ บริษัทอาจต้องเปิดเผยข้อมูลส่วนบุคคลของคุณหากจำเป็นตามกฎหมายหรือตามคำขอที่ถูกต้องจากหน่วยงานของสาธารณะ (เช่นศาลหรือหน่วยงานของรัฐ)"
            },
            "otherLegalRequirements": {
                "title": "ข้อกำหนดทางกฎหมายอื่น ๆ",
                "content": "บริษัทอาจเปิดเผยข้อมูลส่วนบุคคลของคุณในความเชื่อมั่นดีในว่าการดำเนินการดังกล่าวเป็นเรื่องจำเป็นเพื่อ:",
                "listItems": [
                    "ปฏิบัติตามหน้าที่ตามกฎหมาย",
                    "ปกป้องและแก้ไขสิทธิ์หรือทรัพย์สินของบริษัท",
                    "ป้องกันหรือสำรวจความผิดที่เป็นไปได้เกี่ยวกับบริการ",
                    "ปกป้องความปลอดภัยส่วนบุคคลของผู้ใช้บริการหรือสาธารณชน",
                    "ป้องกันความรับผิดตามกฎหมาย"
                ]
            }
        },
        "securityOfPersonalData": {
            "title": "ความปลอดภัยของข้อมูลส่วนบุคคลของคุณ",
            "content": "ความปลอดภัยของข้อมูลส่วนบุคคลของคุณเป็นสิ่งสำคัญต่อเรา แต่โปรดจำไว้ว่าไม่มีวิธีการส่งข้อมูลผ่านอินเทอร์เน็ตหรือวิธีการจัดเก็บข้อมูลอิเล็กทรอนิกส์ที่มีความปลอดภัย 100% ในขณะที่เราพยายามใช้วิธีการที่ยอมรับได้ทางธุรกิจเพื่อปกป้องข้อมูลส่วนบุคคลของคุณ เราไม่สามารถรับประกันความปลอดภัยสมบูรณ์ของข้อมูลส่วนบุคคลได้"
        },
        "childrensPrivacy": {
            "title": "ความเป็นส่วนตัวของเด็ก",
            "content_1": "บริการของเราไม่เกี่ยวข้องกับผู้ใดที่มีอายุต่ำกว่า 13 ปี เราไม่ได้รับข้อมูลที่สามารถระบุตัวบุคคลได้จากบุคคลที่มีอายุต่ำกว่า 13 ปี หากคุณเป็นผู้ปกครองหรือผู้ดูแลและทราบว่าลูกของคุณได้ให้ข้อมูลส่วนบุคคลกับเรา โปรดติดต่อเรา หากเราทราบว่าเราได้เก็บข้อมูลส่วนบุคคลจากบุคคลที่มีอายุต่ำกว่า 13 ปีโดยไม่ได้ตรวจสอบการยินยอมจากผู้ปกครอง เราจะดำเนินการเพื่อลบข้อมูลนั้นออกจากเซิร์ฟเวอร์ของเรา",
            "content_2": "หากเราต้องพึ่งพาการยินยอมเป็นฐานกฎหมายในการดำเนินการกับข้อมูลของคุณและประเทศของคุณกำหนดการยินยอมจากผู้ปกครอง เราอาจขอความยินยอมจากผู้ปกครองของคุณก่อนที่เราจะเก็บรวบรวมและใช้ข้อมูลนั้น"
        },

        "linksToOtherWebsites": {
            "title": "ลิงก์ไปยังเว็บไซต์อื่น",
            "content_1": "บริการของเราอาจมีลิงก์ไปยังเว็บไซต์อื่นที่ไม่ได้ดำเนินการโดยเรา เมื่อคุณคลิกที่ลิงก์ไปยังเว็บไซต์บุคคลที่สาม คุณจะถูกนำไปยังเว็บไซต์ของบุคคลที่สามนั้น เราขอแนะนำให้คุณตรวจสอบนโยบายความเป็นส่วนตัวของทุกเว็บไซต์ที่คุณเยี่ยมชม",
            "content_2": "เราไม่มีควบคุมและไม่รับผิดชอบต่อเนื้อหา นโยบายความเป็นส่วนตัว หรือปฏิบัติการของเว็บไซต์หรือบริการของบุคคลที่สามใด ๆ"
        },
        "changesToPrivacyPolicy": {
            "title": "การเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้",
            "content_1": "เราอาจปรับปรุงนโยบายความเป็นส่วนตัวของเราเป็นครั้งคราว เราจะแจ้งให้คุณทราบเกี่ยวกับการเปลี่ยนแปลงโดยการโพสต์นโยบายความเป็นส่วนตัวใหม่บนหน้านี้",
            "content_2": "เราจะแจ้งให้คุณทราบทางอีเมลและ/หรือผ่านประกาศที่สำคัญบนบริการของเราก่อนการเปลี่ยนแปลงที่จะมีผลบังคับใช้และอัปเดตวันที่ \"ล่าสุด\" ที่ด้านบนของนโยบายความเป็นส่วนตัวนี้",
            "content_3": "คุณแนะนำให้ตรวจสอบนโยบายความเป็นส่วนตัวนี้เป็นระยะๆ เพื่อตรวจสอบการเปลี่ยนแปลงที่เกิดขึ้น การเปลี่ยนแปลงที่นโยบายความเป็นส่วนตัวนี้มีผลเมื่อโพสต์บนหน้านี้"
        },
        "contactUs": {
            "title": "ติดต่อเรา",
            "overView": "หากคุณมีคำถามเกี่ยวกับนโยบายความเป็นส่วนตัวนี้ คุณสามารถติดต่อเราได้ที่:",
            "content": [
                {
                    "href": "mailto:support@snap-share-78f51.firebaseapp.com",
                    "title": "ทางอีเมล: ",
                    "content": "support@snap-share-78f51.firebaseapp.com"
                },
                {
                    "href": "tel:+84399998943",
                    "title": "หมายเลขโทรศัพท์: ",
                    "content": "+84 399998943"
                }
            ]
        }
    }
}
